app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT * FROM "ideas"

  def show
    @idea = Idea.find(params[:id])
---
SELECT * FROM "ideas" WHERE ("ideas"."id" = 1)

  def create
    @idea = Idea.new(params[:idea])

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("created_at", "updated_at", "text") VALUES('2009-12-22 08:35:02', '2009-12-22 08:35:02', 'fgd')

  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy
---
SELECT * FROM "ideas" WHERE ("ideas"."id" = 1)
DELETE FROM "ideas" WHERE "id" = 1